app/controllers/surveys_controller.rb

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
SELECT * FROM `categories` ORDER BY name
---
  def new
    # pull categories
    categories = Category.find(:all, :order => 'name')

    # split categories
    split = 14
    @categories_1 = categories.slice(0, split)
    @categories_2 = categories.slice(split, categories.length - 1)

INSERT INTO `surveys` (`created_at`, `updated_at`) VALUES('2010-03-13 06:08:27', '2010-03-13 06:08:27')
INSERT INTO `survey_responses` (`created_at`, `updated_at`, `survey_id`, `category_id`, `subcategory_id`) VALUES('2010-03-13 06:09:11', '2010-03-13 06:09:11', 3, 5, 15)
---
  def create
    # wrap all in transcation
    Survey.transaction do
      # create new survey
      survey = Survey.create!

      # loop through selections
      params[:selections].each do |selection|
        # parse selection choice
        selection.each do |key, val|
          category_data = key.split(':')

          # category/subcategory
          if category_data.length == 2
            category    = category_data[0]
            subcategory = category_data[1]
          else
            category    = category_data[0]
            subcategory = ''
          end

          #insert responses
          SurveyResponse.create!({
            :survey_id      => survey.id,
            :category_id    => category,
            :subcategory_id => subcategory
          })